[    
    {
      "Q": "What should I do in case of a heart attack?",
      "A": "Stay calm. Call for emergency medical assistance immediately. If an AED is available, use it according to the instructions while waiting for professional help."
    },
    {
      "Q": "How do I use the AED?",
      "A": "Open the AED and follow the audio or visual prompts. Ensure the person is dry, apply the pads to their bare chest, and let the AED analyze the heart rhythm. Press the shock button if instructed."
    },
    {
      "Q": "What is an AED?",
      "A": "An AED (Automated External Defibrillator) is a medical device that can analyze a person's heart rhythm and deliver an electrical shock if needed to help the heart re-establish an effective rhythm."
    },
    {
      "Q": "Can I use the AED if I’m not trained?",
      "A": "Yes, AEDs are designed to be user-friendly with clear instructions. Follow the device's voice prompts, and it will guide you through the process."
    },
    {
      "Q": "What if the AED doesn't work?",
      "A": "If the AED malfunctions or doesn't provide clear instructions, continue performing CPR and call emergency services immediately."
    },
    {
      "Q": "How do I perform CPR?",
      "A": "Place the heel of your hand on the center of the chest, place your other hand on top, and push hard and fast in the center of the chest at a rate of 100-120 compressions per minute. Allow the chest to fully recoil between compressions."
    },
    {
      "Q": "How do I know if someone needs an AED?",
      "A": "If a person is unresponsive, not breathing, or only gasping, an AED may be needed. Begin CPR and apply the AED as soon as it is available."
    },
    {
      "Q": "Can I shock someone if they have a pacemaker?",
      "A": "Yes, you can use an AED on someone with a pacemaker. Place the pads at least 1 inch away from the pacemaker or any implanted device."
    },
    {
      "Q": "What should I do if someone is choking?",
      "A": "If they are unable to breathe or speak, perform the Heimlich maneuver by placing your hands around their waist and giving quick, upward thrusts just above the belly button."
    },
    {
      "Q": "Should I move the person before using the AED?",
      "A": "Only move the person if they are in immediate danger (e.g., fire or unsafe location). Otherwise, use the AED where they are."
    },
    {
      "Q": "What if the AED says 'no shock advised'?",
      "A": "Continue performing CPR until emergency services arrive or the person shows signs of life. The AED will analyze again and give instructions if needed."
    },
    {
      "Q": "Can an AED be used on children?",
      "A": "Yes, but make sure to use pediatric pads if available. If not, adult pads can be used by placing one on the chest and one on the back for children under 8 years old."
    },
    {
      "Q": "How can I stop heavy bleeding?",
      "A": "Apply firm pressure on the wound with a clean cloth or bandage. If possible, elevate the injured area above the heart while keeping pressure on the wound."
    },
    {
      "Q": "How do I treat a burn injury?",
      "A": "Cool the burn with cool (not cold) water for 10-20 minutes. Cover the burn with a clean, non-stick dressing. Do not apply ice, butter, or any ointments."
    },
    {
      "Q": "What do I do if someone faints?",
      "A": "Lay the person down and elevate their legs. Ensure they have plenty of air. If they don't regain consciousness within a minute, call for emergency assistance."
    },
    {
      "Q": "What should I do in case of an allergic reaction?",
      "A": "If they have an epinephrine auto-injector (EpiPen), assist them in using it. Call emergency services immediately if their symptoms worsen or they have trouble breathing."
    },
    {
      "Q": "How do I handle a seizure?",
      "A": "Keep the person safe by moving nearby objects out of the way. Do not hold them down or put anything in their mouth. Once the seizure ends, place them on their side and stay with them until they are fully alert."
    },
    {
      "Q": "What should I do in case of a stroke?",
      "A": "Remember FAST: Face drooping, Arm weakness, Speech difficulty, Time to call emergency services immediately if you notice these symptoms."
    },
    {
      "Q": "What if someone has difficulty breathing?",
      "A": "Help them sit in an upright position and encourage them to take slow, deep breaths. If they are asthmatic, assist them in using their inhaler. If their condition worsens, call for emergency medical assistance."
    },
    {
      "Q": "How do I treat a broken bone?",
      "A": "Keep the injured area still and support it with a splint or sling. Apply ice to reduce swelling, but avoid moving the person unnecessarily."
    },
    {
      "Q": "There's a fire in the store. What should I do?",
      "A": "Evacuate immediately by following the emergency exit signs. Do not use elevators. If possible, assist others, but prioritize your safety."
    },
    {
      "Q": "How do I use a fire extinguisher?",
      "A": "Remember the PASS method: Pull the pin, Aim the nozzle at the base of the fire, Squeeze the handle, and Sweep the nozzle from side to side."
    },
    {
      "Q": "What should I do during an earthquake?",
      "A": "Stay inside, move away from windows, and take cover under sturdy furniture. Hold on until the shaking stops. If outside, move away from buildings and power lines."
    },
    {
      "Q": "Someone is choking, what should I do?",
      "A": "If they can’t breathe, perform the Heimlich maneuver: stand behind the person, wrap your arms around their waist, and give firm, upward abdominal thrusts just above their belly button."
    },
    {
      "Q": "What should I do if I find a suspicious package?",
      "A": "Do not touch or move the package. Evacuate the area immediately and report the package to store personnel or call emergency services."
    },
    {
      "Q": "How do I treat a person who has fainted?",
      "A": "Help them lie down with their legs elevated. Ensure they have fresh air, and if they do not regain consciousness within a minute, call for medical help."
    },
    {
      "Q": "What should I do if I see someone having a seizure?",
      "A": "Move objects away to prevent injury. Don’t restrain the person or put anything in their mouth. Once the seizure ends, place them on their side and wait for help."
    },
    {
      "Q": "What should I do if someone is bleeding heavily?",
      "A": "Apply firm pressure to the wound with a clean cloth. If possible, elevate the injured limb. Call for emergency medical assistance."
    },
    {
      "Q": "There's a chemical spill. What should I do?",
      "A": "Move away from the spill area immediately. If you've come into contact with the chemical, rinse the affected area with water. Alert store personnel and wait for specialized cleanup."
    },
    {
      "Q": "What do I do if someone is electrocuted?",
      "A": "Do not touch the person directly. Turn off the power source if possible or use a non-conductive object to move them away. Call for emergency services immediately."
    },
    {
      "Q": "How do I help someone who is having an allergic reaction?",
      "A": "If they have an epinephrine auto-injector, help them use it immediately. Call for emergency services if symptoms worsen or they have trouble breathing."
    },
    {
      "Q": "What should I do if there's a gas leak?",
      "A": "Evacuate the area immediately without using electrical devices, including lights and phones. Call emergency services once you're in a safe location."
    },
    {
      "Q": "How do I handle a broken bone injury?",
      "A": "Keep the injured limb immobile. Use a splint or sling if available, and apply ice to reduce swelling. Seek medical help as soon as possible."
    },
    {
      "Q": "What do I do during a robbery?",
      "A": "Stay calm, avoid sudden movements, and comply with the demands of the robber. Do not try to confront them. Call emergency services when it's safe."
    },
    {
      "Q": "How can I assist someone having a panic attack?",
      "A": "Encourage them to breathe slowly and deeply, in through the nose and out through the mouth. Stay with them and speak in a calm, reassuring voice."
    },
    {
      "Q": "There's been a power outage. What should I do?",
      "A": "Remain calm and follow the store's emergency lighting to find the exit. Avoid using elevators, and stay alert for instructions from store personnel."
    },
    {
      "Q": "What should I do if someone is drowning?",
      "A": "If safe to do so, get the person out of the water. Call for emergency help. Start CPR immediately if they are unresponsive and not breathing."
    },
    {
      "Q": "What should I do if I witness a car accident near the store?",
      "A": "Call emergency services immediately. If safe, approach the vehicle to check on the occupants but do not move them unless there is a fire or immediate danger."
    },
    {
      "Q": "What should I do if someone collapses from heatstroke?",
      "A": "Move them to a cool place, apply cool cloths or water to their body, and fan them. If they are conscious, give them water to sip. Call for emergency help if they do not improve quickly."
    },
    {
      "Q": "What if I see someone being attacked?",
      "A": "Do not intervene directly. Find a safe location, alert store security or call emergency services, and give them detailed information about the situation."
    },
    {
      "Q": "How do I know if someone is having a stroke?",
      "A": "Look for the FAST signs: Face drooping, Arm weakness, Speech difficulty, and Time to call emergency services immediately."
    },
    {
      "Q": "What should I do during a lockdown?",
      "A": "Find a secure location, lock the doors, turn off lights, and remain quiet. Wait for instructions from authorities or store management before leaving your secure area."
    },
    {
      "Q": "What should I do if I witness a kidnapping?",
      "A": "Immediately call the police with a description of the suspect and the victim. Do not attempt to intervene physically but stay in a safe area to observe and provide information."
    },
    {
      "Q": "How do I assist someone in shock after an accident?",
      "A": "Have the person lie down with their feet elevated. Keep them warm and calm, and seek immediate medical assistance."
    },
    {
      "Q": "What should I do if a fire alarm goes off?",
      "A": "Immediately follow the store’s evacuation plan. Use marked emergency exits and avoid using elevators. Do not attempt to gather personal belongings."
    },
    {
      "Q": "What if I hear gunshots in the store?",
      "A": "Run if it's safe to do so, hide if you cannot run, and as a last resort, prepare to defend yourself. Call emergency services when safe."
    },
    {
      "Q": "How can I help someone with low blood sugar?",
      "A": "Give them a sugary drink or food like juice or candy. If they do not improve within 10 minutes or lose consciousness, call for medical help."
    },
    {
      "Q": "How do I handle a hypothermia emergency?",
      "A": "Move the person to a warm environment. Remove any wet clothing, wrap them in blankets, and offer warm drinks if they are conscious. Call for medical assistance immediately."
    }
  ]
